ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/serial_api.c
            uint8_t rx_data = nrf_uart_rxd_get(global_obj->serial.uart);
            UART_CB->rx_buffer[UART_CB->rx_pos] = rx_data;

            bool end_rx = false;
            // If character matching should be performed, check if the current
            // data matches the given one.
            if (UART_CB->char_match != SERIAL_RESERVED_CHAR_MATCH &&
                rx_data == UART_CB->char_match) {
                // If it does, report the match and abort further receiving.
                UART_CB->events_occured |= SERIAL_EVENT_RX_CHARACTER_MATCH;
                if (UART_CB->events_wanted & SERIAL_EVENT_RX_CHARACTER_MATCH) {
                    end_rx = true;
                }
            }
            if (++UART_CB->rx_pos >= UART_CB->rx_length) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_COMPLETE;
                end_rx = true;
            }
            if (end_rx) {
                end_asynch_rx(global_obj);

                if (UART_CB->rx_asynch_handler) {
                    // Use local variable to make it possible to start a next
                    // transfer from callback routine.
                    void (*handler)() = UART_CB->rx_asynch_handler;
                    UART_CB->rx_asynch_handler = NULL;
                    handler();
                }
            }
        }
        else
    #endif

        if (UART_CB->irq_handler) {
            UART_CB->irq_handler(UART_CB->irq_context, RxIrq);
        }
    }

    if (nrf_uart_int_enable_check(global_obj->serial.uart, NRF_UART_INT_MASK_TXDRDY) &&
        nrf_uart_event_check(global_obj->serial.uart, NRF_UART_EVENT_TXDRDY)) {

    #if DEVICE_SERIAL_ASYNCH
        if (UART_CB->tx_active) {
            if (UART_CB->tx_pos < UART_CB->tx_length) {
                // When there is still something to send, clear the TXDRDY event
                // and put next byte to transmitter.
                nrf_uart_event_clear(global_obj->serial.uart, NRF_UART_EVENT_TXDRDY);
                nrf_uart_txd_set(global_obj->serial.uart,
                    UART_CB->tx_buffer[UART_CB->tx_pos]);
                UART_CB->tx_pos++;
            }
            else {
                // When the TXDRDY event is set after the last byte to be sent
                // has been passed to the transmitter, the job is done and TX
                // complete can be indicated.
                // Don't clear the TXDRDY event, it needs to remain set for the
                // 'serial_writable' function to work properly.
                end_asynch_tx(global_obj);

                UART_CB->events_occured |= SERIAL_EVENT_TX_COMPLETE;
                if (UART_CB->tx_asynch_handler) {
                    // Use local variable to make it possible to start a next
                    // transfer from callback routine.
                    void (*handler)() = UART_CB->tx_asynch_handler;
                    UART_CB->tx_asynch_handler = NULL;
                    handler();
                }
            }
        }
        else
    #endif

        if (UART_CB->irq_handler) {
            UART_CB->irq_handler(UART_CB->irq_context, TxIrq);
        }
    }

#if DEVICE_SERIAL_ASYNCH
    if (nrf_uart_event_check(global_obj->serial.uart, NRF_UART_EVENT_ERROR)) {
        nrf_uart_event_clear(global_obj->serial.uart, NRF_UART_EVENT_ERROR);

        uint8_t errorsrc = nrf_uart_errorsrc_get_and_clear(global_obj->serial.uart);
        if (UART_CB->rx_asynch_handler) {
            UART_CB->events_occured |= SERIAL_EVENT_ERROR;
            if (errorsrc & NRF_UART_ERROR_PARITY_MASK) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_PARITY_ERROR;
            }
            if (errorsrc & NRF_UART_ERROR_FRAMING_MASK) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_FRAMING_ERROR;
            }
            if (errorsrc & NRF_UART_ERROR_OVERRUN_MASK) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_OVERRUN_ERROR;
            }
            UART_CB->rx_asynch_handler();
        }
    }
#endif // DEVICE_SERIAL_ASYNCH
}

void serial_init(serial_t *obj, PinName tx, PinName rx) {

    if(num_serial == 0) {
        obj->serial.uart = NRF_UART0;
        obj->serial.instance = 0;
        obj->serial.IRQn = UART0_IRQn;
        global_obj = obj;
        NVIC_SetVector(UART0_IRQn, (uint32_t) UART0_IRQHandler);
        num_serial++;
    }
    /**
    else {
        obj->serial.uart = NRF_UART1;
        obj->serial.instance = 1;
        obj->serial.IRQn = UART1_IRQn;
        NVIC_SetVector(UART1_IRQn, (uint32_t) UART1_IRQHandler);
    }
    */
        
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 

    UART_CB->pseltxd =
        (tx == NC) ? NRF_UART_PSEL_DISCONNECTED : (uint32_t)tx;
    UART_CB->pselrxd =
        (rx == NC) ? NRF_UART_PSEL_DISCONNECTED : (uint32_t)rx;
    if (UART_CB->pseltxd != NRF_UART_PSEL_DISCONNECTED) {
        nrf_gpio_pin_set(UART_CB->pseltxd);
        nrf_gpio_cfg_output(UART_CB->pseltxd);
    }
    if (UART_CB->pselrxd != NRF_UART_PSEL_DISCONNECTED) {
        nrf_gpio_cfg_input(UART_CB->pselrxd, NRF_GPIO_PIN_NOPULL);
    }

    if (UART_CB->initialized) {
        // For already initialized peripheral it is sufficient to reconfigure
        // RX/TX pins only.

        // Ensure that there is no unfinished TX transfer.
        while (!serial_writable(obj)) {
        }
        // UART pins can be configured only when the peripheral is disabled.
        nrf_uart_disable(obj->serial.uart);
        nrf_uart_txrx_pins_set(obj->serial.uart, UART_CB->pseltxd, UART_CB->pselrxd);
        nrf_uart_enable(obj->serial.uart);
    }
    else {
        UART_CB->baudrate = UART_DEFAULT_BAUDRATE;
        UART_CB->parity   = UART_DEFAULT_PARITY;
        UART_CB->hwfc     = UART_DEFAULT_HWFC;
        UART_CB->pselcts  = UART_DEFAULT_CTS;
        UART_CB->pselrts  = UART_DEFAULT_RTS;

        nrf_uart_event_clear(obj->serial.uart, NRF_UART_EVENT_RXDRDY);
        nrf_uart_event_clear(obj->serial.uart, NRF_UART_EVENT_TXDRDY);
        nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_STARTRX);
        nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_STARTTX);

