ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/serial_api.c
        nrf_uart_int_disable(obj->serial.uart, NRF_UART_INT_MASK_RXDRDY |
                                            NRF_UART_INT_MASK_TXDRDY);
    #if DEVICE_SERIAL_ASYNCH
        nrf_uart_int_enable(obj->serial.uart, NRF_UART_INT_MASK_ERROR);
    #endif
        nrf_drv_common_irq_enable(obj->serial.IRQn, NRFx_MBED_UART_IRQ_PRIORITY);

        // TX interrupt needs to be signaled when transmitter buffer is empty,
        // so a dummy transmission is needed to get the TXDRDY event initially
        // set.
        nrf_uart_configure(obj->serial.uart,
            NRF_UART_PARITY_EXCLUDED, NRF_UART_HWFC_DISABLED);
        // Use maximum baud rate, so this dummy transmission takes as little
        // time as possible.
        nrf_uart_baudrate_set(obj->serial.uart, NRF_UART_BAUDRATE_1000000);
        // Perform it with disconnected TX pin, so nothing actually comes out
        // of the device.
        nrf_uart_txrx_pins_disconnect(obj->serial.uart);
        nrf_uart_hwfc_pins_disconnect(obj->serial.uart);
        nrf_uart_enable(obj->serial.uart);
        nrf_uart_txd_set(obj->serial.uart, 0);
        while (!nrf_uart_event_check(obj->serial.uart, NRF_UART_EVENT_TXDRDY)) {
        }
        nrf_uart_disable(obj->serial.uart);

        // Now everything is prepared to set the default configuration and
        // connect the peripheral to actual pins.
        nrf_uart_txrx_pins_set(obj->serial.uart, UART_CB->pseltxd, UART_CB->pselrxd);
        nrf_uart_baudrate_set(obj->serial.uart, UART_CB->baudrate);
        nrf_uart_configure(obj->serial.uart, UART_CB->parity, UART_CB->hwfc);
        if (UART_CB->hwfc == NRF_UART_HWFC_ENABLED) {
            internal_set_hwfc(obj, FlowControlRTSCTS,
                (PinName) UART_CB->pselrts, (PinName) UART_CB->pselcts);
        }

        nrf_uart_enable(obj->serial.uart);

        UART_CB->initialized = true;
    }

    if (tx == STDIO_UART_TX && rx == STDIO_UART_RX) {
        stdio_uart_inited = 1;
        memcpy(&stdio_uart, obj, sizeof(serial_t));
    }
    else {
        stdio_uart_inited = 0;
    }
}

void serial_free(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    if (UART_CB->initialized) {
        nrf_uart_disable(obj->serial.uart);
        nrf_uart_int_disable(obj->serial.uart, NRF_UART_INT_MASK_RXDRDY |
                                            NRF_UART_INT_MASK_TXDRDY |
                                            NRF_UART_INT_MASK_ERROR);
        nrf_drv_common_irq_disable(obj->serial.IRQn);
        UART_CB->initialized = false;

        // There is only one UART instance, thus at this point the stdio UART
        // can no longer be initialized.
        stdio_uart_inited = 0;
    }
}

void serial_baud(serial_t *obj, int baudrate)
{
    // nrf_uart_baudrate_set() is not used here (registers are accessed
    // directly) to make it possible to set special baud rates like 56000
    // or 31250.

    static uint32_t const acceptedSpeeds[][2] = {
        { 1200,    UART_BAUDRATE_BAUDRATE_Baud1200   },
        { 2400,    UART_BAUDRATE_BAUDRATE_Baud2400   },
        { 4800,    UART_BAUDRATE_BAUDRATE_Baud4800   },
        { 9600,    UART_BAUDRATE_BAUDRATE_Baud9600   },
        { 14400,   UART_BAUDRATE_BAUDRATE_Baud14400  },
        { 19200,   UART_BAUDRATE_BAUDRATE_Baud19200  },
        { 28800,   UART_BAUDRATE_BAUDRATE_Baud28800  },
        { 31250,   (0x00800000UL) /* 31250 baud */   },
        { 38400,   UART_BAUDRATE_BAUDRATE_Baud38400  },
        { 56000,   (0x00E51000UL) /* 56000 baud */   },
        { 57600,   UART_BAUDRATE_BAUDRATE_Baud57600  },
        { 76800,   UART_BAUDRATE_BAUDRATE_Baud76800  },
        { 115200,  UART_BAUDRATE_BAUDRATE_Baud115200 },
        { 230400,  UART_BAUDRATE_BAUDRATE_Baud230400 },
        { 250000,  UART_BAUDRATE_BAUDRATE_Baud250000 },
        { 460800,  UART_BAUDRATE_BAUDRATE_Baud460800 },
        { 921600,  UART_BAUDRATE_BAUDRATE_Baud921600 },
        { 1000000, UART_BAUDRATE_BAUDRATE_Baud1M     }
    };

    if (baudrate <= 1200) {
        obj->serial.uart->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud1200;
        return;
    }

    int const item_cnt = sizeof(acceptedSpeeds)/sizeof(acceptedSpeeds[0]);
    for (int i = 1; i < item_cnt; i++) {
        if ((uint32_t)baudrate < acceptedSpeeds[i][0]) {
            obj->serial.uart->BAUDRATE = acceptedSpeeds[i - 1][1];
            return;
        }
    }

    obj->serial.uart->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud1M;
}

void serial_format(serial_t *obj,
                   int data_bits, SerialParity parity, int stop_bits)
{

    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 

    if (data_bits != 8) {
        error("UART supports only 8 data bits.\r\n");
    }
    if (stop_bits != 1) {
        error("UART supports only 1 stop bits.\r\n");
    }
    if (parity == ParityNone) {
        UART_CB->parity = NRF_UART_PARITY_EXCLUDED;
    } else if (parity == ParityEven) {
        UART_CB->parity = NRF_UART_PARITY_INCLUDED;
    } else {
        error("UART supports only even parity.\r\n");
    }

    // Reconfigure UART peripheral.
    nrf_uart_configure(obj->serial.uart, UART_CB->parity, UART_CB->hwfc);
}

void serial_irq_handler(serial_t *obj, uart_irq_handler handler, uint32_t id)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    UART_CB->irq_handler = handler;
    UART_CB->irq_context = id;
}

void serial_irq_set(serial_t *obj, SerialIrq irq, uint32_t enable)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    if (enable) {
        switch (irq) {
            case RxIrq:
            #if DEVICE_SERIAL_ASYNCH
                UART_CB->irq_enabled |= UART_IRQ_RX;
            #endif
                nrf_uart_int_enable(obj->serial.uart, NRF_UART_INT_MASK_RXDRDY);
                break;

            case TxIrq:
            #if DEVICE_SERIAL_ASYNCH
                UART_CB->irq_enabled |= UART_IRQ_TX;
            #endif
                nrf_uart_int_enable(obj->serial.uart, NRF_UART_INT_MASK_TXDRDY);
                break;
        }
    } else {
        switch (irq) {
            case RxIrq:
            #if DEVICE_SERIAL_ASYNCH
                UART_CB->irq_enabled &= ~UART_IRQ_RX;
                if (!UART_CB->rx_active)
            #endif
                {
                    nrf_uart_int_disable(obj->serial.uart,
                        NRF_UART_INT_MASK_RXDRDY);
                }
                break;

            case TxIrq:
            #if DEVICE_SERIAL_ASYNCH
                UART_CB->irq_enabled &= ~UART_IRQ_TX;
                if (!UART_CB->tx_active)
            #endif
                {
                    nrf_uart_int_disable(obj->serial.uart,
                        NRF_UART_INT_MASK_TXDRDY);
                }
                break;
        }
    }
}

int serial_getc(serial_t *obj)
{
    while (!serial_readable(obj)) {
    }

    nrf_uart_event_clear(obj->serial.uart, NRF_UART_EVENT_RXDRDY);
    return nrf_uart_rxd_get(obj->serial.uart);
}

void serial_putc(serial_t *obj, int c)
{
    while (!serial_writable(obj)) {
    }

