ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/serial_api.c
    nrf_uart_event_clear(obj->serial.uart, NRF_UART_EVENT_TXDRDY);
    nrf_uart_txd_set(obj->serial.uart, (uint8_t)c);
}

int serial_readable(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
#if DEVICE_SERIAL_ASYNCH
    if (UART_CB->rx_active) {
        return 0;
    }
#endif
    return (nrf_uart_event_check(obj->serial.uart, NRF_UART_EVENT_RXDRDY));
}

int serial_writable(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
#if DEVICE_SERIAL_ASYNCH
    if (UART_CB->tx_active) {
        return 0;
    }
#endif
    return (nrf_uart_event_check(obj->serial.uart, NRF_UART_EVENT_TXDRDY));
}

void serial_break_set(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_SUSPEND);
    nrf_uart_txrx_pins_disconnect(obj->serial.uart);
    nrf_gpio_pin_clear(UART_CB->pseltxd);
}

void serial_break_clear(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    nrf_gpio_pin_set(UART_CB->pseltxd);
    nrf_uart_txrx_pins_set(obj->serial.uart, UART_CB->pseltxd, UART_CB->pselrxd);
    nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_STARTRX);
    nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_STARTTX);
}


static void internal_set_hwfc(serial_t *obj, FlowControl type,
                             PinName rxflow, PinName txflow)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    UART_CB->pselrts =
        ((rxflow == NC) || (type == FlowControlCTS)) ? NRF_UART_PSEL_DISCONNECTED : (uint32_t)rxflow;
    UART_CB->pselcts =
        ((txflow == NC) || (type == FlowControlRTS)) ? NRF_UART_PSEL_DISCONNECTED : (uint32_t)txflow;

    if (UART_CB->pselrts != NRF_UART_PSEL_DISCONNECTED) {
        nrf_gpio_pin_set(UART_CB->pselrts);
        nrf_gpio_cfg_output(UART_CB->pselrts);
    }
    if (UART_CB->pselcts != NRF_UART_PSEL_DISCONNECTED) {
        nrf_gpio_cfg_input(UART_CB->pselcts, NRF_GPIO_PIN_NOPULL);
    }

    UART_CB->hwfc = (nrf_uart_hwfc_t)((type == FlowControlNone)? NRF_UART_HWFC_DISABLED  : UART_DEFAULT_CONFIG_HWFC);

    nrf_uart_configure(obj->serial.uart, UART_CB->parity, UART_CB->hwfc);
    nrf_uart_hwfc_pins_set(obj->serial.uart, UART_CB->pselrts, UART_CB->pselcts);
}

void serial_set_flow_control(serial_t *obj, FlowControl type,
                             PinName rxflow, PinName txflow)
{
    nrf_uart_disable(obj->serial.uart);
    internal_set_hwfc(obj, type, rxflow, txflow);
    nrf_uart_enable(obj->serial.uart);
}


void serial_clear(serial_t *obj) {
    (void)obj;
}

#if DEVICE_SERIAL_ASYNCH

int serial_tx_asynch(serial_t *obj, const void *tx, size_t tx_length,
                     uint8_t tx_width, uint32_t handler, uint32_t event,
                     DMAUsage hint)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    (void)tx_width;
    (void)hint;
    if (UART_CB->tx_active || !tx_length) {
        return 0;
    }

    UART_CB->tx_buffer = tx;
    UART_CB->tx_length = tx_length;
    UART_CB->tx_pos    = 0;
    UART_CB->tx_asynch_handler = (void(*)())handler;
    UART_CB->events_wanted &= ~SERIAL_EVENT_TX_ALL;
    UART_CB->events_wanted |= event;

    UART_CB->tx_active = true;
    nrf_uart_int_enable(obj->serial.uart, NRF_UART_INT_MASK_TXDRDY);

    return 0;
}

void serial_rx_asynch(serial_t *obj, void *rx, size_t rx_length,
                      uint8_t rx_width, uint32_t handler, uint32_t event,
                      uint8_t char_match, DMAUsage hint)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    (void)rx_width;
    (void)hint;
    if (UART_CB->rx_active || !rx_length) {
        return;
    }

    UART_CB->rx_buffer = rx;
    UART_CB->rx_length = rx_length;
    UART_CB->rx_pos    = 0;
    UART_CB->rx_asynch_handler = (void(*)())handler;
    UART_CB->events_wanted &= ~SERIAL_EVENT_RX_ALL;
    UART_CB->events_wanted |= event;
    UART_CB->char_match = char_match;

    UART_CB->rx_active = true;
    nrf_uart_int_enable(obj->serial.uart, NRF_UART_INT_MASK_RXDRDY);
}

uint8_t serial_tx_active(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    return UART_CB->tx_active;
}

uint8_t serial_rx_active(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    return UART_CB->rx_active;
}

int serial_irq_handler_asynch(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    uint32_t events_to_report = UART_CB->events_wanted & UART_CB->events_occured;
    UART_CB->events_occured &= (~events_to_report);
    return events_to_report;
}

void serial_tx_abort_asynch(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    end_asynch_tx(obj);
    UART_CB->tx_asynch_handler = NULL;
}

void serial_rx_abort_asynch(serial_t *obj)
{
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 
    end_asynch_rx(obj);
    UART_CB->rx_asynch_handler = NULL;
}

#endif // DEVICE_SERIAL_ASYNCH

#endif // DEVICE_SERIAL
